#include <iostream>
//#include <valarray>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int x1, y1, x2, y2;
	char fig;
	cout << "Введите фигуру" << endl << "P-пешка, H-конь, E-слон, L-лодья, Q-королева, K-король." << endl;
	cin >> fig;
	cout << "Введите координаты фигуры (Х1;У1)" << endl;
	cin >> x1 >> y1;
	cout << "Куда хотите пойти" << endl;
	cin >> x2 >> y2;
	if ((x1 > 0) && (x1 < 9) && (y1 > 0) && (y1 < 9) && (x2 > 0) && (x2 < 9) && (y2 > 0) && (y2 < 9))
	{
		if (fig == 'P')
		{
			if ((x1 == x2) && (y2 - y1 == 1))
			{
				cout << "Ход сделан верно";
			}
			else
			{
				cout << "Ход сделан не верно";
			}

		}
		if (fig == 'E')
		{
			if (abs(x1 - x2) == abs(y1 - y2))
			{
				cout << "Ход сделан верно";
			}
			else
			{
				cout << "Ход сделан не верно";
			}
		}
		if (fig == 'H')
		{
			if ((((abs(x1 - x2)) == 1) && ((abs(y1 - y2) == 2))) || ((abs(x1 - x2) == 2) && ((abs(y1 - y2) == 1))))
			{
				cout << "Ход сделан верно";
			}

			else
			{
				cout << "Ход сделан неправильно";

			}

		}
		if (fig == 'L')
		{
			if (((x1 == x2) && (y1 > 0) && (y1 < 9)) || ((x1 > 0) && (x1 < 9) && (y1 == y2)))
			{
				cout << "Ход сделан верно";
			}
			else
			{
				cout << "Ход сделан неправильно";
			}
		}
		if (fig == 'Q')
		{
			if ((((x1 == x2)/* && (y1 > 0) && (y1 < 9)) || ((x1 > 0) && (x1 < 9) &&*/|| (y1 == y2))) || (abs(x1 - x2) == (abs(y1 - y2))))

			{
				cout << "Ход сделан верно";
			}
			else { cout << "Ход сделан не верно"; }
		}
		if (fig == 'K')
		{
			if (((abs(x1 - x2) == 1) && (abs(y1 - y2) == 0)) || ((abs(x1 - x2) == 0) && (abs(y1 - y2) == 1)) || ((abs(x1 - x2) == 1) && (abs(y1 - y2) == 1)))
			{
				cout << "Ход сделан верно";
			}
			else
			{
				cout << "Ход сделан не верно";
			}
		}
	}
	else
	{
		cout << "Невозможно сделать ход";
	}
}


